In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [3]:
animals = DataFrame(np.arange(16).reshape(4, 4),
                   index = ["Dog", "Cat", "Bird", "Mouse"],
                   columns = ["W", "X", "Y", "Z"])
animals

        W   X   Y   Z
Dog     0   1   2   3
Cat     4   5   6   7
Bird    8   9  10  11
Mouse  12  13  14  15

In [42]:
animals.iloc[[1],[0, 2]] = np.nan
animals

          W   X     Y   Z
Dog     0.0   1   2.0   3
Cat     NaN   5   NaN   7
Bird    8.0   9  10.0  11
Mouse  12.0  13  14.0  15

In [50]:
behavior_map = {"W" : "good", "X" : "bad", "Y" : "good", "Z" : "bad"}

In [56]:
animal_col = animals.T.groupby(behavior_map)
animal_col.sum()

      Dog   Cat  Bird  Mouse
bad   4.0  12.0  20.0   28.0
good  2.0   0.0  18.0   26.0

In [60]:
behave_series = Series(behavior_map)
behave_series

W    good
X     bad
Y    good
Z     bad
dtype: object

In [62]:
animals.T.groupby(behave_series).count()

      Dog  Cat  Bird  Mouse
bad     2    2     2      2
good    2    0     2      2

In [66]:
animals

          W   X     Y   Z
Dog     0.0   1   2.0   3
Cat     NaN   5   NaN   7
Bird    8.0   9  10.0  11
Mouse  12.0  13  14.0  15

In [64]:
# dog and cat have len 3, bird 4, mouse 5...then add columns
animals.groupby(len).sum()

      W   X     Y   Z
3   0.0   6   2.0  10
4   8.0   9  10.0  11
5  12.0  13  14.0  15

In [68]:
keys = ["A", "B", "A", "B"]

In [72]:
# add keys
animals.groupby([len, keys]).max()

        W   X     Y   Z
3 A   0.0   1   2.0   3
  B   NaN   5   NaN   7
4 A   8.0   9  10.0  11
5 B  12.0  13  14.0  15

In [76]:
hier_col = pd.MultiIndex.from_arrays([["NY", "NY", "NY", "SF", "SF"], [1, 2, 3, 1, 2]], names = ["City", "sub_value"])
hier_col

MultiIndex([('NY', 1),
            ('NY', 2),
            ('NY', 3),
            ('SF', 1),
            ('SF', 2)],
           names=['City', 'sub_value'])

In [92]:
dframe_hier = DataFrame(np.arange(25).reshape(5, 5), columns = hier_col)
dframe_hier

City       NY          SF
sub_value   1   2   3   1   2
0           0   1   2   3   4
1           5   6   7   8   9
2          10  11  12  13  14
3          15  16  17  18  19
4          20  21  22  23  24

In [96]:
dframe_hier = dframe_hier * 100

In [98]:
dframe_hier

City         NY                SF
sub_value     1     2     3     1     2
0             0   100   200   300   400
1           500   600   700   800   900
2          1000  1100  1200  1300  1400
3          1500  1600  1700  1800  1900
4          2000  2100  2200  2300  2400